{
    "Cloud computing": "Cloud computing is the delivery of computing services—including servers, storage, databases, networking, software, analytics, and intelligence—over the Internet (“the cloud”) to offer faster innovation, flexible resources, and economies of scale.",
    "UX design": "User Experience Design (UXD or UED) is a design process whose sole objective is to design a system that offers a great experience to its users. Thus UXD embraces the theories of a number of disciplines such as user interface design, usability, accessibility, information architecture, and Human Computer Interaction. User Experience Design is practiced by User Experience Designers—who are particularly concerned with the interaction that occurs between users and the system they are using.",
    "Animation ": "Animation is the capturing of sequential, static images—drawings or photos of inanimate objects—and playing them in rapid succession to mimic real world motion. If you’ve ever seen a flip book, you know how it works.",
    "Foreign Languages": "In today’s era, multilingualism has become more than just ‘important’. Knowing a foreign language other than your native language has evolved to be extremely beneficial. Whether viewed from the financial or social aspect, being able to communicate in a foreign language helps to make ‘real’ connection with people and provides a better understanding of your language. Apart from the financial gains learning a foreign dialect can offer a unique experience to travellers. People, who love to explore different parts of the world, know about diverse cultures, places, and lifestyle, knowing the local language can offer a life changing experience. You can easily find the places, ask for directions, and even order food. Speaking a language gives you a better understanding of the country’s culture. You can interact with people more freely providing a greater scope of meeting new people, making new friends, more fun, and enjoyment.",
    "Cybersecurity ": "Cybersecurity is the practice of protecting systems, networks, and programs from digital attacks. These cyberattacks are usually aimed at accessing, changing, or destroying sensitive information; extorting money from users; or interrupting normal business processes.Implementing effective cybersecurity measures is particularly challenging today because there are more devices than people, and attackers are becoming more innovative.",
    "Ethical Hacking": "Ethical hacking involves a hacker agreeing with an organization or individual who authorizes the hacker to levy cyber attacks on a system or network to expose potential vulnerabilities. An ethical hacker is also sometimes referred to as a white hat hacker. Many depend on ethical hackers to identify weaknesses in their networks, endpoints, devices, or applications. The hacker informs their client as to when they will be attacking the system, as well as the scope of the attack. An ethical hacker operates within the confines of their agreement with their client. They cannot work to discover vulnerabilities and then demand payment to fix them. This is what gray hat hackers do. Ethical hackers are also different from black hat hackers, who hack to harm others or benefit themselves without permission.",
    "VR (virtual reality)": "Virtual Reality (VR) refers to using computer technology to create a simulated environment. Unlike traditional user interfaces, the user is placed inside experiences in the case of VR. The users, instead of viewing the screen in front of them, are immersed and are able to interact with 3D environments. Virtual reality helps stimulate senses such as smell, vision, touch, and hearing. In virtual reality, the computer uses sensors and math. Rather than locating a real camera within a physical environment, the user’s eyes are positioned within the simulated environment. The graphics react according to the head movements of the user. VR technology creates an interactive and convincing world for the user, rather than compositing a real scene and virtual objects.",
    "Packaging design": "Packaging design is the connection of form, structure, materials, color, imagery, typography, and regulatory information with ancillary design elements to make a product suitable for marketing. Its primary objective is to create a vehicle that serves to contain, protect, transport, dispense, store, identify, and distinguish a product in the marketplace. Ultimately, the goal of a packaging design is to meet marketing objectives by distinctively communicating a consumer product's personality or function and generating a sale.",
    "Sustainable farming": "Sustainable farming or, in a broader term, Sustainable agriculture is using farming practices considering the ecological cycles. It is also sensitive towards the microorganisms and their equations with the environment at large. In simpler terms, sustainable farming is farming ecologically by promoting methods and practices that are economically viable, environmentally sound and protect public health.",
    "Managing environmental resources": "Managing environmental resources refers to the sustainable utilization of major natural resources, such as land, water, air, minerals, forests, fisheries, and wild flora and fauna. Environmental resource management is the management of the interaction and impact of human societies on the environment. It is not, as the phrase might suggest, the management of the environment itself. Environmental resources management aims to ensure that ecosystem services are protected and maintained for future human generations, and also maintain ecosystem integrity through considering ethical, economic, and scientific variables. Environmental resource management tries to identify factors affected by conflicts that rise between meeting needs and protecting resources. It is thus linked to environmental protection and sustainability.",
    "Mushroom cultivation": "Mushroom cultivation is the same as any other kind of cultivation – but they’re quite fiddly to grow. Mushrooms are grown from ‘spawn’ – mushroom tissue culture that has been produced from spores grown in sterile / laboratory conditions (contamination is a big problem at this stage). Spawn can be obtained from specialist suppliers, then added to a substrate (compost, a log, coffee grounds etc.) to spread their mycelium (thread-like root system) and produce a crop.",
    "Beekeeping": "Beekeeping, or apiculture as it is also known, is the human activity of maintaining honey bees. A beekeeper, or apiarist (that will soon be you), is someone who keeps honey bees for the purpose of collecting their honey and other products that are produced by the hive such as propolis, beeswax and royal jelly, or to pollinate crops, or to produce bees for sale to other beekeepers. Beekeeping can be done using stinging or stingless bees.",
    "Tree Fruit production": "Fruit trees are not usually grown from seed because if they are, the fruit doesn't usually taste very good! That's because many fruit trees are cross pollinated. Fruit trees have some DNA from the mother tree and some from the father tree. The resulting seed will have a completely new genetic make-up. And if you plant that seed, the new tree will produce fruit that is nothing like the fruit produced by either parent.Grafted fruit trees are like an insurance policy that can offer the following benefits:They will provide you with a guaranteed variety like Honey crisp or Gala apples.They may offer pest and disease resistance.They may be selected to withstand cold climates.",
    "Grazing management": "Grazing management must address the need to integrate parasite control measures together with the provision of sufficient quantities of nutritious grass at the correct stage of growth throughout the grazing season.Grazing management is the planning, implementation and monitoring of animal grazing to achieve sustained animal, plant, land, environmental and economic results under a range of environmental conditions.Grazing management practices seek to optimize livestock production and maintain productive grasslands by minimizing overgrazing, improving forage production and increasing plant and animal diversity. Grazing, when well-managed, allows healthy grasslands to be sustained, livestock operations to meet economic requirements and other plants and animals to flourish. Well-managed grazing techniques can reverse damage and help to restore grassland health.",
    "Understanding global food systems": "The food system can be defined as the complete set of people, institutions, activities, processes, and infrastructure involved in producing and consuming food.",
    "Sports/Fitness Coach/Nutritionist": "A sports and fitness nutritionist is responsible for teaching athletes and fitness enthusiasts effective ways to improve their health, optimize their performance and manage their weight. Nutritionists may advise individuals on dietary practices; exercise; and use of vitamins, minerals and supplements. To be successful in sports and fitness nutrition, you must have extensive knowledge of the human body and dietary practices, and a passion for working with people on a personal, individual level. A greater interest in preventative care in the U.S. means job growth in the coming years is expected to be strong.",
    "Audio Production": "Audio production is a term used for all the stages of production between the actual recording in a studio and the execution of a master recording. Audio Production involves various different stages from sound design, to sound editing, to audio mixing, and finally the addition of effects.",
    "Translating and languages": "Language translation is the process of converting the written word from one language into another language in a way that is culturally and linguistically appropriate so it can be understood by its intended audience. What is Language Interpretation? Whereas language translation refers only to the written word, interpreting refers to spoken word. An interpreter’s job is to facilitate communication between two people who speak different languages, whether the conversation takes place over the phone, in person, or via video remote interpreting.",
    "Playing musical instruments": "Musical instrument such as a piano, guitar, or violin which you play in order to produce music.",
    "Performing arts": "Performing arts refers to forms of art in which artists use their voices, bodies or inanimate objects to convey artistic expression.",
    "Creative writing": "his Specialization covers elements of three major creative writing genres: short story, narrative essay, and memoir. You will master the techniques that good writers use to compose a bracing story, populated with memorable characters in an interesting setting, written in a fresh descriptive style. You will analyze and constructively evaluate peer writing. In the Capstone, you will draft, rewrite, and complete a substantial original story in the genre of your choosing.",
    "Animal husbandry": "Animal husbandry is the branch of agriculture where animals are reared, bred and raised for meat, fiber, eggs, milk and other food products.",
    "Learn to knit (sweater) (Knitting, Sewing, and Crocheting)": "Sewing, knitting, and crocheting are all a way to make clothing and other items. They each utilize stitches to create something, but they are not the same.The main difference between the three comes down to the tools and types of stitches that are used for each one.",
    "Drawing": "The term drawing is applied to works that vary greatly in technique. It has been understood in different ways at different times and is difficult to define. During the Renaissance the term 'disegno' implied drawing both as a technique to be distinguished from colouring and also as the creative idea made visible in the preliminary sketch.",
    "Painting": "Painting is the application of pigments to a support surface that establishes an image, design or decoration. In art the term “painting” describes both the act and the result. Most painting is created with pigment in liquid form and applied with a brush. Exceptions to this are found in Navajo sand painting and Tibetan mandala painting, where powdered pigments are used.",
    "Graphic Design ": "Graphic design is a craft where professionals create visual content to communicate messages. By applying visual hierarchy and page layout techniques, designers use typography and pictures to meet users’ specific needs and focus on the logic of displaying elements in interactive designs, to optimize the user experience.",
    "Illustration": "An illustration is a visualization or a depiction made by an artist, such as a drawing, sketch, painting, photograph, or other kind of image of things seen, remembered or imagined, using a graphical representation. An art illustrator tells a story through their drawings.",
    "Sculpting": "culpting is the art of creating objects by shaping materials. This shaping can be carving, where material is removed from an object like marble to reveal form, or modeling, where the artist creates form by adding materials, such as clay. The process of sculpting starts with the artist conceptualising a particular subject. Subsequently, the artist decides the size of the sculpture and material to be used."
}